/* Ви прийшли в Макдональдз з трьома друзями.
    Всі вони хочуть зʼїсти гамбургер. Ви хочете зʼїсти гамбургер з картоплею.
    Реалізувати код, який буде перевіряти, що якщо всім вистачає гамбургерів і картоплі,
    то виводити текст "Ми поїли" в консоль. Якщо на всіх не вистачає їжі,
    то виводити в консоль текст "Ми йдемо в інше кафе"
    (Змінні типу інтеджер містять кількість продуктів в наявності у вигляді вхідних даних)
*/

let hamburger = 4;
let HamburgerWithFries = 2;

if(hamburger >= 3 && HamburgerWithFries >= 1){
    console.log("We have eaten! Yummy!")
}
else{
    console.log("We're going to another restaurant! F*ck this place!")
}